## Pandas

The Pandas library is built on NumPy and provides easy-to-use data structures and data analysis tools for the Python programming language.

Use the following import convention:

In [1]:
import pandas as pd

In [8]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Multiple conditional using ``&`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 1) & (df['shield'] < 8)]
           max_speed  shield
    viper          4       5

    Multiple conditional using ``|`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 4) | (df['shield'] < 5)]
                max_speed  shield
    cobra               1       2
    sidewinder          7       8

    Please ensure that each condition is wrapped in parentheses ``()``.
    See the :ref:`user guide<indexing.boolean>`
    for more details and explanations of Boolean indexing.

    .. note::
        If you find yourself using 3 or more conditionals in ``.loc[]``,
        consider using :ref:`advanced indexing<advanced.advanced_hierarchical>`.

        See below for using ``.loc[]`` on MultiIndex DataFrames.

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    Add value matching location

    >>> df.loc["viper", "shield"] += 5
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       5
    sidewinder          0       0

    Setting using a ``Series`` or a ``DataFrame`` sets the values matching the
    index labels, not the index positions.

    >>> shuffled_df = df.loc[["viper", "cobra", "sidewinder"]]
    >>> df.loc[:] += shuffled_df
    >>> df
                max_speed  shield
    cobra              60      20
    viper               0      10
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

    Please see the :ref:`user guide<advanced.advanced_hierarchical>`
    for more details and explanations of advanced indexing.

### Asking For Help

### Pandas Data Structures

* Series

A one-dimensional labeled array capable of holding any data type

In [2]:
s = pd.Series([3,-5,7,1.5], index=["a","b","c","d"])

s

a    3.0
b   -5.0
c    7.0
d    1.5
dtype: float64

* Dataframe

A two-dimensional labeled data structure with columns of potentially different types

In [4]:
data = {"Country":["Turkey","Poland","French"],
        "Capital":["Ankara","Warsaw","Paris"],
        "Country Phone Code":[90,48,33]}

dataframe = pd.DataFrame(data) 

dataframe

  Country Capital  Country Phone Code
0  Turkey  Ankara                  90
1  Poland  Warsaw                  48
2  French   Paris                  33

1. Columns = Country,Capital, Country Phone Code

2. Index = 0,1,2

### Dropping

In [7]:
data = {"Country":["Turkey","Poland","French"],
        "Capital":["Ankara","Warsaw","Paris"],
        "Country Phone Code":[90,48,33]}

df = pd.DataFrame(data)   # df = dataframe

df = df.drop("Country", axis= 1)  # Drop values from columns(axis=1)

df

  Capital  Country Phone Code
0  Ankara                  90
1  Warsaw                  48
2   Paris                  33

### Sort & Rank

In [13]:
d = {'col1': [5, 2,10,4,7], 'col2': [1, 3,8,11,25]}

df = pd.DataFrame(data=d)

df.sort_index()  # ort by labels along an axis

   col1  col2
0     5     1
1     2     3
2    10     8
3     4    11
4     7    25

In [14]:
df.sort_values(by = "col1")  # Sort by the values along an axis

   col1  col2
1     2     3
3     4    11
0     5     1
4     7    25
2    10     8

In [15]:
df.rank()  # Assign ranks to entries

   col1  col2
0   3.0   1.0
1   1.0   2.0
2   5.0   3.0
3   2.0   4.0
4   4.0   5.0

**Rename of Columns**

In [78]:
d = {'col_old': [5, 2,10,4,7], 'col2': [1, 3,8,11,25]}

df = pd.DataFrame(data=d)

df.rename(columns={"col_old":"col_new"}, inplace=True)

df

   col_new  col2
0        5     1
1        2     3
2       10     8
3        4    11
4        7    25

**Read and Write to CSV**

* File type is important for read

In [17]:
# pd.read_csv("file.csv")

**Read and Write to Excel**

In [18]:
# pd.read_excel("file.xlsx")

### Selection

* Getting

In [20]:
import numpy as np

df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [21]:
df["a"]  # Get column

0    1
1    4
2    7
Name: a, dtype: int32

In [22]:
df[1:]  # Get subset of a DataFrame

   a  b  c
1  4  5  6
2  7  8  9

* Selecting, Boolean Indexing & Setting

By Position

In [28]:
data = {"Country":["Turkey","Poland","French"],
        "Capital":["Ankara","Warsaw","Paris"],
        "Country Phone Code":[90,48,33]}

df = pd.DataFrame(data)

df

  Country Capital  Country Phone Code
0  Turkey  Ankara                  90
1  Poland  Warsaw                  48
2  French   Paris                  33

In [29]:
df.iloc[0,0]  # Select single value by row & column

'Turkey'

In [24]:
df.iloc[[0],[0]]

  Country
0  Turkey

By Label

In [26]:
df.loc[1,"Country"]  #Select single value by row & column labels

'Poland'

In [27]:
df.loc[[1],["Country"]]

  Country
1  Poland

Boolean Indexing

In [31]:
data = {"Country":["Belgium","India","Brazil"],
        "Capital":["Brussels","New Delhi","Brasilia"],
        "Population":[11190846, 1303171035, 207847528]}

df = pd.DataFrame(data)

df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [33]:
df[df["Country"] == "India"]  # Use filter to adjust DataFrame

  Country    Capital  Population
1   India  New Delhi  1303171035

In [38]:
df[df["Population"] >= 12000000]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [45]:
df[(df["Population"] >= 10000) & (df["Population"] < 120000000)]

   Country   Capital  Population
0  Belgium  Brussels    11190846

* Setting

In [47]:
df["Population"] = 100000

df

   Country    Capital  Population
0  Belgium   Brussels      100000
1    India  New Delhi      100000
2   Brazil   Brasilia      100000

### Retrieving Series/DataFrame Information

* Basic Selection

In [86]:
data = {"a":[1, 2, 3, 5, 6, 7, 8, 9, 10,"a"], 
                   "b":[11, 12, 13, 14, 15, 16, 17, 18, 19,"b"]}

df = pd.DataFrame(data)

df.head()  # Select first n rows.

   a   b
0  1  11
1  2  12
2  3  13
3  5  14
4  6  15

In [87]:
df.tail()  # Select last n rows.

    a   b
5   7  16
6   8  17
7   9  18
8  10  19
9   a   b

In [88]:
data = {"Country":["Belgium","India","Brazil"],
        "Capital":["Brussels","New Delhi","Brasilia"],
        "Population":[11190846, 1303171035, 207847528]}

df = pd.DataFrame(data)

df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [90]:
df[["Country","Population"]]  # Select multiple columns with specific names

   Country  Population
0  Belgium    11190846
1    India  1303171035
2   Brazil   207847528

In [91]:
df.Country

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

* Basic Information

In [48]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
df.shape  # (rows,columns)

(3, 3)

In [53]:
df.index  # Describe index

RangeIndex(start=0, stop=3, step=1)

In [54]:
df.columns   # Describe DataFrame columns

Index(['a', 'b', 'c'], dtype='object')

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      int32
 2   c       3 non-null      int32
dtypes: int32(3)
memory usage: 168.0 bytes

In [57]:
df.count()

a    3
b    3
c    3
dtype: int64

In [59]:
df = pd.DataFrame(np.array([[1, np.nan, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

df

     a    b    c
0  1.0  NaN  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0

In [60]:
df.isnull()

       a      b      c
0  False   True  False
1  False  False  False
2  False  False  False

In [61]:
df.isnull().sum()  # Sum of NA Values

a    0
b    1
c    0
dtype: int64

* Summary

In [100]:
data = {'col1': [1, 2, 5, 7, 9], 'col2': [3, 4, 10, 8, 6]}

df = pd.DataFrame(data)

df

   col1  col2
0     1     3
1     2     4
2     5    10
3     7     8
4     9     6

In [101]:
df.sum()  # Sum of values

col1    24
col2    31
dtype: int64

In [102]:
df.cumsum()  # Cummulative sum of values

   col1  col2
0     1     3
1     3     7
2     8    17
3    15    25
4    24    31

In [103]:
display(df.min())

#Minimum/maximum values

display(df.max())

col1    1
col2    3
dtype: int64

col1     9
col2    10
dtype: int64

In [70]:
display(df.idxmin())

#Minimum/Maximum index value

display(df.idxmax())

col1    0
col2    0
dtype: int64

col1    4
col2    2
dtype: int64

In [104]:
df.describe()  # Summary statistics

          col1       col2
count  5.00000   5.000000
mean   4.80000   6.200000
std    3.34664   2.863564
min    1.00000   3.000000
25%    2.00000   4.000000
50%    5.00000   6.000000
75%    7.00000   8.000000
max    9.00000  10.000000

In [105]:
df.shift(1)

   col1  col2
0   NaN   NaN
1   1.0   3.0
2   2.0   4.0
3   5.0  10.0
4   7.0   8.0

In [106]:
df.shift(-1)

   col1  col2
0   2.0   4.0
1   5.0  10.0
2   7.0   8.0
3   9.0   6.0
4   NaN   NaN

### Applying Functions

In [72]:
f = lambda x: x*2

In [73]:
df.apply(f)

   col1  col2
0     2     6
1     4     8
2    10    20
3    14    16
4    18    12

### Data Alignment

*  Internal Data Alignment

NA values are introduced in the indices that dont overlap:

In [75]:
s = pd.Series([3,-5,7,1.5], index=["a","b","c","d"])

s2 = pd.Series([7,-2,3], index =["a","c","d"])


s + s2

a    10.0
b     NaN
c     5.0
d     4.5
dtype: float64

* Arithmetic Operations with Fill Methods

You can also do the internal data alignment yourself with the help of the fill methods:

In [76]:
s.add(s2, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     4.5
dtype: float64

### Combine Data Set

In [94]:
data_1 = {"x1":["A","B","C"], "x2":[1,2,3]}
data_2 = {"x1":["A","B","D"], "x3":[4,5,6]}

df_1 = pd.DataFrame(data_1)

df_2 = pd.DataFrame(data_2)

df_merge = pd.merge(df_1,df_2, how = "left", on ="x1")

df_merge

  x1  x2   x3
0  A   1  4.0
1  B   2  5.0
2  C   3  NaN

In [95]:
df_merge = pd.merge(df_1,df_2, how = "right", on ="x1")

df_merge

  x1   x2  x3
0  A  1.0   4
1  B  2.0   5
2  D  NaN   6

In [97]:
df_merge = pd.merge(df_1,df_2, how = "inner", on ="x1")

df_merge

  x1  x2  x3
0  A   1   4
1  B   2   5

In [98]:
df_merge = pd.merge(df_1,df_2, how = "outer", on ="x1")

df_merge

  x1   x2   x3
0  A  1.0  4.0
1  B  2.0  5.0
2  C  3.0  NaN
3  D  NaN  6.0

In [99]:
df_isin = df_1[df_1["x1"].isin(df_2["x1"])]

df_isin

  x1  x2
0  A   1
1  B   2